<template>
  <div id="app">
    <router-view></router-view>
  </div>
</template>

<script>
var departments = [
  {id: 1, name: 'Бухгалтерия', desc: 'Штатно-структурное подразделение хозяйствующего субъекта, предназначенное для аккумулирования данных о его имуществе и обязательствах. Бухгалтерия является источником документально обоснованной и структурированной экономической информации, необходимой для принятия управленческих решений в целях обеспечения эффективного хозяйствования'},
  {id: 2, name: 'Отдел технического контроля', desc: 'Самостоятельное подразделение производственной организации (предприятия), которое осуществляет независимый контроль соответствия продукции установленным требованиям и гарантирует это соответствие потребителю. Отдел технического контроля подчиняется высшему руководству организации (предприятия), что обеспечивает независимость контроля.'},
  {id: 3, name: 'Отдел кадров', desc: 'Совокупность специализированных подразделений в структуре предприятия (с занятыми в них должностными лицами — руководителями, специалистами, техническим персоналом), призванных управлять персоналом предприятия.'}
]
var localDeportaments = JSON.stringify(departments)
window.localStorage.setItem('departments', localDeportaments)

var persons = [
  {
    departmentsId: 1,
    id: 1,
    lname: 'Петров',
    fname: 'Иван',
    otch: 'Петрович',
    phone: '8 (952) 562-98-65'
  },
  {
    departmentsId: 1,
    id: 2,
    lname: 'Проп',
    fname: 'Андрей',
    otch: 'Дмитриевич',
    phone: '8 (952) 122-45-12'
  },
  {
    departmentsId: 2,
    id: 3,
    lname: 'Семенов',
    fname: 'Максим',
    otch: 'Владимирович',
    phone: '8 (952) 422-94-21'
  },
  {
    departmentsId: 2,
    id: 4,
    lname: 'Ильясов',
    fname: 'Алексей',
    otch: 'Сергеевич',
    phone: '8 (952) 523-11-74'
  },
  {
    departmentsId: 2,
    id: 5,
    lname: 'Ильмн',
    fname: 'Денис',
    otch: 'Дмитриевич',
    phone: '8 (952) 211-23-65'
  },
  {
    departmentsId: 3,
    id: 6,
    lname: 'Иванов',
    fname: 'Сергей',
    otch: 'Владимирович',
    phone: '8 (952) 562-12-51'
  },
  {
    departmentsId: 3,
    id: 7,
    lname: 'Петров',
    fname: 'Максим',
    otch: 'Сергеевич',
    phone: '8 (952) 522-12-21'
  }
]
var localPerson = JSON.stringify(persons)
window.localStorage.setItem('person', localPerson)
</script>

<style>

</style>
