<template>
  <div id="app">
    <router-view></router-view>
  </div>
</template>

<script>
var departments = [
  {id: 1, name: 'Бухалтерия', desc: 'Штатно-структурное подразделение хозяйствующего субъекта, предназначенное для аккумулирования данных о его имуществе и обязательствах. Бухгалтерия является источником документально обоснованной и структурированной экономической информации, необходимой для принятия управленческих решений в целях обеспечения эффективного хозяйствования'},
  {id: 2, name: 'Отдел технического контроля', desc: 'Самостоятельное подразделение производственной организации (предприятия), которое осуществляет независимый контроль соответствия продукции установленным требованиям и гарантирует это соответствие потребителю. Отдел технического контроля подчиняется высшему руководству организации (предприятия), что обеспечивает независимость контроля.'},
  {id: 3, name: 'Отдел кадров', desc: 'Совокупность специализированных подразделений в структуре предприятия (с занятыми в них должностными лицами — руководителями, специалистами, техническим персоналом), призванных управлять персоналом предприятия.'}
]
var localDeportaments = JSON.stringify(departments)
window.localStorage.setItem('departments', localDeportaments)

var employees = [
  {id: 1, fullname: 'Максим Колмогорв'},
  {id: 2, fullname: 'Максим asdasd'},
  {id: 3, fullname: 'asdasd Колмогоров'},
  {id: 4, fullname: 'asdasd Колмоssssров'}
]
var localEmployees = JSON.stringify(employees)
window.localStorage.setItem('employees', localEmployees)

var persons = [
  {
    id: 1,
    lname: 'Петров',
    fname: 'Иван',
    otch: 'Петрович',
    phone: '8 (952) 562-98-65'
  },
  {
    id: 2,
    Фамилия: 'Проп',
    Имя: 'Андрей',
    Отчество: 'Пеыывич',
    Телефон: '8 (952) 522-12-64'
  }
]
var localPerson = JSON.stringify(persons)
window.localStorage.setItem('person', localPerson)

</script>

<style>

</style>
