var departments = [
  {id: 1, name: "Бухалтерия", desc: "Штатно-структурное подразделение хозяйствующего субъекта, предназначенное для аккумулирования данных о его имуществе и обязательствах. Бухгалтерия является источником документально обоснованной и структурированной экономической информации, необходимой для принятия управленческих решений в целях обеспечения эффективного хозяйствования"},
  {id: 2, name: "Отдел технического контроля", desc: "Самостоятельное подразделение производственной организации (предприятия), которое осуществляет независимый контроль соответствия продукции установленным требованиям и гарантирует это соответствие потребителю. Отдел технического контроля подчиняется высшему руководству организации (предприятия), что обеспечивает независимость контроля."},
  {id: 3, name: "Отдел кадров", desc: "Совокупность специализированных подразделений в структуре предприятия (с занятыми в них должностными лицами — руководителями, специалистами, техническим персоналом), призванных управлять персоналом предприятия."}
];


var va = new Vue({
  el: '#depart-desc',
  data: {
    departments: departments
  }
})
